emails_patterns = {
    'application_created': f'<p> שלום רב! </p>'
                           f'<p> לתשומת ליבך – נכנסה בקשה חדשה לפתיחת הליך קידום שהוגשה ע"י %degree %name לעיונך.</p>',
    'application_received': f'<div> %name שלום רב %degree,</div>'
                            f'<p> בקשתך התקבלה ונמצאת בטיפול.</p>'
                            f'<p> בימים הקרובים תקבל עדכון על המשך התהליך.</p>'
                            f'<p> בברכת הצלחה.</p>',
    'dph_approve': f'<p> מרצה יקר/ה,</p>'
                   f'<p> אישרתי את בקשתך ואני פועל לקידום ההליך. בברכת הצלחה.</p>',
    'dph_feedback': f'<p> מרצה יקר/ה, יש להוסיף/לשנות/לתקן את קורות החיים בהתאם להערות מצ"ב.</p>',
    'dph_deny': f'<p> מרצה יקר/ה,</p>'
                f'<p> לצערי ולמרות הערכתי הרבה אליך, אני דוחה בזאת את בקשתך בשלב זה לתחילת הליך הקידום.</p>'
                f'<p> בברכה,</p>'
                f'<p> %name </p>',
    'admin_approve': f'<p> מרצה יקר/ה, פנייתך הועברה לגורם המטפל. בהצלחה!</p>',
    'admin_feedback': f'<p> מרצה יקר/ה, יש להוסיף/לשנות/לתקן את קורות החיים בהתאם להערות מצ"ב.</p>',
    'chair_approve': f'<p> מרצה יקר/ה, בקשתך לפתיחת הליך קידום אושרה.</p><br>'
                     f'<p> בהצלחה,</p>'
                     f"<p> פרופ' ניר קידר</p>"
                     f"<p>  המשנה לנשיא</p>",
    'chair_feedback': f'<p> מרצה יקר/ה, פנייתך הועברה לגורם המטפל. בהצלחה!</p>',
    'chair_deny': f'<p> מרצה יקר/ה,</p>'
                  f'<p> לאחר בחינה מעמיקה של בקשתך לקידום, צר לי אך בשלב זה תיקך לא נמצא מתאים לקידום.</p>'
                  f'<p> אני מזמין אותך לקבל סיוע ממלווה אקדמי אשר יוכל לסייע לך ולחדד את הנדרש '
                  f'לטובת פניה נוספת בהמשך.</p>'
                  f'<p> בהצלחה בהמשך,</p><br>'
                  f'<p> באיחולי הצלחה,</p>'
                  f"<p> פרופ' ניר קידר</p>"
                  f"<p> המשנה לנשיא</p>"
}
