emails_patterns = {
    'application_created': f'שלום רב! \n'
                           f' לתשומת ליבך – נכנסה בקשה חדשה לפתיחת הליך קידום שהוגשה ע"י %name לעיונך',
    'application_received': f'%name שלום רב,'
                            f'בקשתך התקבלה ונמצאת בטיפול.'
                            f'בימים הקרובים תקבל עדכון על המשך התהליך.'
                            f'בברכת הצלחה.',
    'dph_approve': f'מרצה יקר/ה, אישרתי את בקשתך ואני פועל לקידום ההליך. בברכת הצלחה.',
    'dph_feedback': f'מרצה יקר/ה, יש להוסיף/לשנות/לתקן את קורות החיים בהתאם להערות מצ"ב.',
    'dph_deny': f'מרצה יקר/ה, לצערי ולמרות הערכתי הרבה אליך, אני דוחה בזאת את בקשתך בשלב זה לתחילת הליך הקידום.'
                f'בברכה,'
                f'%name',
    'admin_approve': f'מרצה יקר/ה, פנייתך הועברה לגורם המטפל. בהצלחה!',
    'admin_feedback': f'מרצה יקר/ה, יש להוסיף/לשנות/לתקן את קורות החיים בהתאם להערות מצ"ב.',
    'chair_approve': f'מרצה יקר/ה, בקשתך לפתיחת הליך קידום אושרה.\n'
                     f'בהצלחה,'
                     f"פרופ' ניר קידר"
                     f"המשנה לנשיא",
    'chair_feedback': f'מרצה יקר/ה, פנייתך הועברה לגורם המטפל. בהצלחה!',
    'chair_deny': f'מרצה יקר/ה,'
                  f'לאחר בחינה מעמיקה של בקשתך לקידום, צר לי אך בשלב זה תיקך לא נמצא מתאים לקידום.'
                  f'אני מזמין אותך לקבל סיוע ממלווה אקדמי אשר יוכל לסייע לך ולחדד את הנדרש לטובת פניה נוספת בהמשך.'
                  f'בהצלחה בהמשך, \n'
                  f'באיחולי הצלחה,'
                  f"פרופ' ניר קידר"
                  f"המשנה לנשיא"
}
