email_patterns = [
    {
        'actionType': "application_created",
        'text': f'שלום רב! \n'
                f' לתשומת ליבך – נכנסה בקשה חדשה לפתיחת הליך קידום שהוגשה ע"י %name לעיונך'
    },
    {
        'actionType': "dph_feedback",
        'text': f'מרצה יקר, יש להוסיף/לשנות/לתקן את קורות החיים בהתאם להערות מצ"ב.'
    },
    {
        'actionType': "dph_aprove",
        'text': f'מרצה יקר/ה, אישרתי את בקשתך ואני פועל לקידום ההליך. בברכת הצלחה.'
    },
    {
        'actionType': "dph_deny",
        'text': f'מרצה יקר, לצערי ולמרות הערכתי הרבה אליך, אני דוחה בזאת את בקשתך בשלב זה לתחילת הליך הקידום.'
                f'בברכה,'
                f'%name'
    },
    {
        'actionType': "admin_aprove",
        'text': f'מרצה יקר/ה, פנייתך הועברה לגורם המטפל. בהצלחה!'
    },
    {
        'actionType': "chair_aprove",
        'text': f'מרצה יקר/ה, בקשתך לפתיחת הליך קידום אושרה.\n'
                f'בהצלחה,'
                f"פרופ' ניר קידר"
                f"המשנה לנשיא"
    },
    {
        'actionType': "chair_feedback",
        'text': f'מרצה יקר/ה,'
                f'לאחר בחינה מעמיקה של בקשתך לקידום, צר לי אך בשלב זה תיקך לא נמצא מתאים לקידום.'
                f'אני מזמין אותך לקבל סיוע ממלווה אקדמי אשר יוכל לסייע לך ולחדד את הנדרש לטובת פניה נוספת בהמשך.'
                f'בהצלחה בהמשך, \n'
                f'באיחולי הצלחה,'
                f"פרופ' ניר קידר"
                f"המשנה לנשיא"
    },

]

emails_patterning = {
        'application_created': f'שלום רב! \n'
                f' לתשומת ליבך – נכנסה בקשה חדשה לפתיחת הליך קידום שהוגשה ע"י %name לעיונך'
    }